[
    {
        "Name": "Aloevera",
        "Description": "A succulent plant species known for its medicinal properties. It is cultivated worldwide for its gel, which is used in various health and beauty products.",
        "Location": "Found in tropical climates, commonly grown in gardens and as potted plants indoors.",
        "Medical_Usage": "Used for treating skin conditions, burns, wounds, and as a dietary supplement."
    },
    {
        "Name": "Amla",
        "Description": "Also known as Indian gooseberry, it is a small tree native to India that produces greenish-yellow fruit renowned for its high vitamin C content.",
        "Location": "Native to India and found in tropical and subtropical regions of Asia.",
        "Medical_Usage": "Used in traditional Ayurvedic medicine for improving digestion, boosting immunity, and promoting hair growth."
    },
    {
        "Name": "Amruthaballi",
        "Description": "Known as Giloy or Guduchi, it is a climbing shrub native to India. It has heart-shaped leaves and is valued for its medicinal properties.",
        "Location": "Found in tropical regions, especially in the Indian subcontinent.",
        "Medical_Usage": "Used in Ayurveda for its immunomodulatory properties, treating fever, diabetes, and improving digestion."
    },
    {
        "Name": "Arali",
        "Description": "A plant known for its large leaves and medicinal uses in traditional medicine.",
        "Location": "Found in tropical and subtropical regions, often cultivated in gardens.",
        "Medical_Usage": "Used for treating respiratory ailments and as an anti-inflammatory."
    },
    {
        "Name": "Astma_weed",
        "Description": "Also known as Euphorbia hirta, it is a small annual herb known for its medicinal properties in treating asthma and other respiratory disorders.",
        "Location": "Found in tropical and subtropical regions worldwide, often considered a weed in gardens.",
        "Medical_Usage": "Used traditionally for treating asthma, bronchitis, and skin infections."
    },
    {
        "Name": "Badipala",
        "Description": "A plant known for its ornamental value and used in traditional medicine for various health benefits.",
        "Location": "Found in gardens and cultivated areas in tropical and subtropical regions.",
        "Medical_Usage": "Used for treating skin disorders, promoting hair growth, and as a diuretic."
    },
    {
        "Name": "Balloon_Vine",
        "Description": "A climbing plant known for its small white flowers and inflated seed pods, found in tropical and subtropical regions.",
        "Location": "Commonly found in disturbed areas, gardens, and along roadsides.",
        "Medical_Usage": "Used in traditional medicine for its diuretic, antipyretic, and anti-inflammatory properties."
    },
    {
        "Name": "Bamboo",
        "Description": "A fast-growing woody plant known for its strength and versatility, used in construction and various crafts.",
        "Location": "Native to Asia, found in tropical and temperate regions worldwide.",
        "Medical_Usage": "Used in traditional medicine for treating fever, respiratory disorders, and as a source of nutrients."
    },
    {
        "Name": "Beans",
        "Description": "A variety of leguminous plants cultivated for their edible seeds and pods.",
        "Location": "Grown in gardens, farms, and cultivated areas worldwide.",
        "Medical_Usage": "Rich in protein and nutrients, used in diets to promote heart health and manage diabetes."
    },
    {
        "Name": "Betel",
        "Description": "A vine belonging to the Piperaceae family, cultivated for its leaves which are chewed with betel nut and lime as a stimulant.",
        "Location": "Native to Southeast Asia and cultivated in tropical regions.",
        "Medical_Usage": "Used in traditional medicine for its stimulant, carminative, and antiseptic properties."
    },
    {
        "Name": "Bhrami",
        "Description": "A creeping herb known for its medicinal properties, used in Ayurvedic medicine to enhance memory and cognitive functions.",
        "Location": "Found in damp and marshy areas in tropical regions.",
        "Medical_Usage": "Used for improving memory, reducing anxiety, and treating epilepsy and asthma."
    },
    {
        "Name": "Bringaraja",
        "Description": "Also known as False Daisy, it is a herbaceous plant valued for its medicinal properties in hair care and traditional medicine.",
        "Location": "Native to India and Southeast Asia, cultivated in tropical regions.",
        "Medical_Usage": "Used in Ayurvedic medicine for promoting hair growth, treating liver disorders, and as a diuretic."
    },
    {
        "Name": "Caricature",
        "Description": "A small tropical tree with edible fruit, known for its medicinal properties in traditional medicine.",
        "Location": "Found in tropical and subtropical regions, cultivated for its fruit.",
        "Medical_Usage": "Used for treating digestive disorders, promoting heart health, and as a diuretic."
    },
    {
        "Name": "Castor",
        "Description": "A fast-growing shrub cultivated for its seeds, which are the source of castor oil used in various industrial and medicinal applications.",
        "Location": "Native to Africa and India, cultivated in tropical and subtropical regions worldwide.",
        "Medical_Usage": "Used in traditional medicine for its laxative, anti-inflammatory, and antibacterial properties."
    },
    {
        "Name": "Catharanthus",
        "Description": "A genus of flowering plants known for their colorful flowers and medicinal properties.",
        "Location": "Found in tropical and subtropical regions, cultivated as ornamental and medicinal plants.",
        "Medical_Usage": "Used for producing vinblastine and vincristine, chemotherapy drugs for treating cancer."
    },
    {
        "Name": "Chakte",
        "Description": "A small tree native to Mexico known for its medicinal uses.",
        "Location": "Found in tropical and subtropical regions, cultivated for its wood and medicinal properties.",
        "Medical_Usage": "Used in traditional medicine for treating fever, inflammation, and digestive disorders."
    },
    {
        "Name": "Chilly",
        "Description": "A spicy fruit from plants belonging to the genus Capsicum, widely used in culinary dishes worldwide.",
        "Location": "Cultivated in gardens and farms in tropical and subtropical regions.",
        "Medical_Usage": "Used for its capsaicin content, which has analgesic properties and is used in topical creams for pain relief."
    },
    {
        "Name": "Citron lime (herelikai)",
        "Description": "A citrus fruit tree known for its distinctive aroma and culinary uses.",
        "Location": "Native to Southeast Asia and cultivated in tropical regions worldwide.",
        "Medical_Usage": "Used in traditional medicine for its antioxidant properties and to aid digestion."
    },
    {
        "Name": "Coffee",
        "Description": "A small evergreen tree cultivated for its beans, which are roasted and brewed to make coffee.",
        "Location": "Native to tropical Africa and cultivated in tropical and subtropical regions worldwide.",
        "Medical_Usage": "Used as a stimulant, improves mental alertness and physical performance, and contains antioxidants."
    },
    {
        "Name": "Common rue(naagdalli)",
        "Description": "A perennial herb known for its blue-green foliage and medicinal properties.",
        "Location": "Native to Mediterranean regions and cultivated in gardens worldwide.",
        "Medical_Usage": "Used in traditional medicine for treating menstrual disorders, arthritis, and as an insect repellent."
    },
    {
        "Name": "Coriender",
        "Description": "Also known as cilantro or Chinese parsley, it is an annual herb cultivated for its leaves and seeds used in culinary dishes.",
        "Location": "Native to regions spanning from Southern Europe and North Africa to southwestern Asia.",
        "Medical_Usage": "Used in traditional medicine for its digestive, antibacterial, and antioxidant properties."
    },
    {
        "Name": "Curry",
        "Description": "A variety of aromatic herbs and spices used to prepare curry dishes, known for their culinary and medicinal properties.",
        "Location": "Cultivated in gardens and farms in tropical and subtropical regions worldwide.",
        "Medical_Usage": "Used in traditional medicine for its anti-inflammatory, antimicrobial, and digestive benefits."
    },
    {
        "Name": "Doddpathre",
        "Description": "A medicinal plant used in Ayurvedic and traditional medicine for its therapeutic properties.",
        "Location": "Found in tropical and subtropical regions, often cultivated in gardens.",
        "Medical_Usage": "Used for treating respiratory disorders, promoting digestion, and as a natural insect repellent."
    },
    {
        "Name": "Drumstick",
        "Description": "A fast-growing tree known for its long, slender pods filled with seeds that are used in culinary dishes and traditional medicine.",
        "Location": "Native to India and cultivated in tropical and subtropical regions worldwide.",
        "Medical_Usage": "Used for its nutritional value, promoting digestion, and as an anti-inflammatory."
    },
{
    "Name": "Ekka",
    "Description": "A tree with small yellow flowers and oval leaves, known for its medicinal properties in traditional medicine.",
    "Location": "Native to tropical and subtropical regions, often found near water bodies.",
    "Medical_Usage": "Used for treating skin diseases, fever, and respiratory ailments."
},
{
    "Name": "Eucalyptus",
    "Description": "A genus of trees known for their aromatic leaves and medicinal properties.",
    "Location": "Native to Australia, now cultivated in temperate and subtropical regions worldwide.",
    "Medical_Usage": "Used for its antiseptic, expectorant, and decongestant properties in treating respiratory conditions."
},
{
    "Name": "Ganigale",
    "Description": "A herbaceous plant with aromatic leaves and small white flowers, used in traditional medicine for its medicinal properties.",
    "Location": "Native to tropical and subtropical regions, cultivated for its medicinal uses.",
    "Medical_Usage": "Used for treating digestive disorders, as an antispasmodic, and for its calming effects."
},
{
    "Name": "Ganike",
    "Description": "A vine known for its heart-shaped leaves and small white flowers, used in traditional medicine for its medicinal properties.",
    "Location": "Found in tropical and subtropical regions, often cultivated as an ornamental plant.",
    "Medical_Usage": "Used for treating skin diseases, fever, and respiratory ailments."
},
{
    "Name": "Gasagase",
    "Description": "A plant known for its small white flowers and seeds, used in culinary dishes and traditional medicine.",
    "Location": "Native to South Asia, cultivated in tropical and subtropical regions.",
    "Medical_Usage": "Used for its anti-inflammatory properties and as a digestive aid."
},
{
    "Name": "Ginger",
    "Description": "A flowering plant known for its underground rhizomes used as a spice and in traditional medicine.",
    "Location": "Native to Southeast Asia, cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for treating nausea, indigestion, inflammation, and as an antioxidant."
},
{
    "Name": "Globe Amarnath",
    "Description": "An annual herb with pink or purple flowers, cultivated for its edible and medicinal uses.",
    "Location": "Native to subtropical regions, commonly grown in gardens and cultivated areas.",
    "Medical_Usage": "Used in traditional medicine for treating diarrhea, inflammation, and as an antioxidant."
},
{
    "Name": "Guava",
    "Description": "A small tree or shrub with edible fruits, known for its nutritional value and medicinal uses.",
    "Location": "Native to tropical America, now grown in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its high vitamin C content, as an antidiarrheal, and for its wound healing properties."
},
{
    "Name": "Henna",
    "Description": "A flowering plant known for its dye-producing leaves, used in cosmetic and medicinal applications.",
    "Location": "Native to North Africa, West Asia, and South Asia, cultivated in tropical and subtropical regions.",
    "Medical_Usage": "Used for dyeing hair, skin, and nails; also used for its cooling and anti-inflammatory properties."
},
{
    "Name": "Hibiscus",
    "Description": "A genus of flowering plants known for their large, colorful flowers and medicinal properties.",
    "Location": "Native to tropical and subtropical regions, cultivated as ornamental plants and for medicinal use.",
    "Medical_Usage": "Used for lowering blood pressure, as a diuretic, and for its antioxidant properties."
},
{
    "Name": "Honge",
    "Description": "A medium-sized tree with bright yellow flowers, known for its medicinal properties in traditional medicine.",
    "Location": "Native to tropical regions, commonly found in forests and cultivated areas.",
    "Medical_Usage": "Used for treating skin diseases, digestive disorders, and as an anti-inflammatory agent."
},
{
    "Name": "Insulin",
    "Description": "A climbing vine with yellow flowers, used in traditional medicine for its medicinal properties.",
    "Location": "Native to tropical and subtropical regions, often cultivated for its medicinal uses.",
    "Medical_Usage": "Used for treating diabetes, skin diseases, and as a diuretic."
},
{
    "Name": "Jackfruit",
    "Description": "A large tropical tree with edible fruits that are a source of food and medicinal benefits.",
    "Location": "Native to South and Southeast Asia, now cultivated in tropical regions worldwide.",
    "Medical_Usage": "Used for its nutritional value, as a digestive aid, and for treating skin diseases."
},
{
    "Name": "Jasmine",
    "Description": "A genus of shrubs and vines known for their fragrant white or yellow flowers, used in perfumery and traditional medicine.",
    "Location": "Native to tropical and temperate regions, cultivated for ornamental purposes and medicinal use.",
    "Medical_Usage": "Used for treating headaches, insomnia, anxiety, and as a sedative."
},
{
    "Name": "Kambajala",
    "Description": "A plant with aromatic leaves and small white flowers, used in traditional medicine for its medicinal properties.",
    "Location": "Native to tropical and subtropical regions, often found in gardens and cultivated areas.",
    "Medical_Usage": "Used for treating digestive disorders, respiratory ailments, and as an anti-inflammatory."
},
{
    "Name": "Kasambruga",
    "Description": "A small shrub with yellow flowers, known for its medicinal properties in traditional medicine.",
    "Location": "Native to tropical and subtropical regions, commonly found in coastal areas.",
    "Medical_Usage": "Used for treating skin diseases, fever, and respiratory ailments."
},
{
    "Name": "Kohlrabi",
    "Description": "A biennial vegetable with a swollen stem that resembles a turnip, used for its edible bulb and leaves.",
    "Location": "Native to Europe, now cultivated in temperate and subtropical regions worldwide.",
    "Medical_Usage": "Used for its nutritional value, as a diuretic, and for treating digestive disorders."
},
{
    "Name": "Lantana",
    "Description": "A genus of flowering plants known for their colorful flowers and medicinal uses in traditional medicine.",
    "Location": "Native to tropical and subtropical regions, cultivated as ornamental plants and for medicinal purposes.",
    "Medical_Usage": "Used for treating skin diseases, respiratory ailments, and as an insect repellent."
},
{
    "Name": "Lemon",
    "Description": "A small evergreen tree with edible fruits known for their acidic juice used in culinary and medicinal applications.",
    "Location": "Native to South Asia, now grown in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its high vitamin C content, as a digestive aid, and for its antibacterial properties."
},
{
    "Name": "Lemongrass",
    "Description": "A tall perennial grass known for its lemony flavor and medicinal properties.",
    "Location": "Native to tropical and subtropical regions of Asia, now cultivated worldwide.",
    "Medical_Usage": "Used for its antimicrobial, anti-inflammatory, and digestive properties."
},
{
    "Name": "Malabar_Nut",
    "Description": "A shrub with violet flowers and medicinal properties in traditional medicine.",
    "Location": "Native to tropical regions, commonly found in forests and cultivated areas.",
    "Medical_Usage": "Used for treating respiratory ailments, fever, and as an expectorant."
},
{
    "Name": "Malabar_Spinach",
    "Description": "A leafy green vegetable with medicinal properties, used in culinary dishes and traditional medicine.",
    "Location": "Native to tropical and subtropical regions, cultivated for its edible leaves and medicinal uses.",
    "Medical_Usage": "Used for its nutritional value, as an antioxidant, and for treating digestive disorders."
},
{
    "Name": "Mango",
    "Description": "A tropical fruit tree known for its sweet and juicy fruits, valued for their nutritional and medicinal benefits.",
    "Location": "Native to South Asia, now cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its high vitamin C content, as a digestive aid, and for its antioxidant properties."
},
{
    "Name": "Marigold",
    "Description": "A genus of flowering plants known for their bright orange or yellow flowers and medicinal uses.",
    "Location": "Native to North and Central America, now cultivated worldwide for ornamental and medicinal purposes.",
    "Medical_Usage": "Used for treating skin conditions, eye inflammation, and as an antiseptic."
},
{
    "Name": "Mint",
    "Description": "A genus of aromatic herbs known for their culinary uses and medicinal properties.",
    "Location": "Native to temperate regions, now grown worldwide in gardens and cultivated areas.",
    "Medical_Usage": "Used for digestive disorders, respiratory ailments, and as a flavoring agent."
},
{
    "Name": "Neem",
    "Description": "A fast-growing evergreen tree known for its bitter leaves and seeds, used in traditional medicine and agriculture.",
    "Location": "Native to the Indian subcontinent, now grown in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its antibacterial, antifungal, and antiparasitic properties; also used in skincare products."
},
{
    "Name": "Nelavembu",
    "Description": "Also known as Andrographis paniculata, it is a herbaceous plant used in traditional medicine for its potent medicinal properties.",
    "Location": "Native to South Asian countries, especially India and Sri Lanka.",
    "Medical_Usage": "Used for treating fever, infections, and as an immune booster."
},
{
    "Name": "Nerale",
    "Description": "Also known as Indian blackberry or jamun, it is a tropical tree with edible fruit known for its medicinal properties.",
    "Location": "Native to the Indian subcontinent, found in tropical and subtropical regions.",
    "Medical_Usage": "Used for managing diabetes, improving digestion, and treating skin ailments."
},
{
    "Name": "Nooni",
    "Description": "Also known as Noni or Morinda citrifolia, it is a small evergreen tree with a pungent fruit used in traditional medicine.",
    "Location": "Native to Southeast Asia and Australasia, cultivated in tropical regions worldwide.",
    "Medical_Usage": "Used for its anti-inflammatory, antioxidant, and immune-boosting properties."
},
{
    "Name": "Onion",
    "Description": "A bulbous vegetable cultivated worldwide for its culinary uses and medicinal properties.",
    "Location": "Cultivated worldwide in temperate and tropical regions.",
    "Medical_Usage": "Used for its antibacterial, anti-inflammatory, and antioxidant properties."
},
{
    "Name": "Padri",
    "Description": "A plant with medicinal properties used in traditional medicine.",
    "Location": "Native to tropical and subtropical regions.",
    "Medical_Usage": "Used for treating fever, digestive disorders, and respiratory ailments."
},
{
    "Name": "Palak (Spinach)",
    "Description": "A leafy green vegetable known for its high nutritional value.",
    "Location": "Cultivated worldwide in temperate and tropical regions.",
    "Medical_Usage": "Rich in vitamins and minerals, used for improving digestion and as an antioxidant."
},
{
    "Name": "Papaya",
    "Description": "A tropical fruit tree known for its sweet orange fruit and numerous medicinal properties.",
    "Location": "Native to tropical America, now grown in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for digestive disorders, skin care, and as an anti-inflammatory."
},
{
    "Name": "Parijatha",
    "Description": "Also known as Night-flowering Jasmine, it is a small tree with fragrant flowers used in traditional medicine.",
    "Location": "Native to South Asia and Southeast Asia, found in tropical and subtropical regions.",
    "Medical_Usage": "Used for treating coughs, arthritis, and skin diseases."
},
{
    "Name": "Pea",
    "Description": "A leguminous plant grown for its edible seeds, known for their nutritional value.",
    "Location": "Cultivated worldwide in temperate and subtropical regions.",
    "Medical_Usage": "Rich in protein and fiber, used for improving digestion and overall health."
},
{
    "Name": "Pepper",
    "Description": "A flowering vine cultivated for its fruit, which is dried and used as a spice and seasoning.",
    "Location": "Native to South India, cultivated in tropical regions worldwide.",
    "Medical_Usage": "Used for its digestive, antioxidant, and anti-inflammatory properties."
},
{
    "Name": "Pomegranate",
    "Description": "A fruit-bearing shrub or small tree known for its edible seeds and medicinal properties.",
    "Location": "Native to the region from Iran to northern India, cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its antioxidant, anti-inflammatory, and heart health benefits."
},
{
    "Name": "Pumpkin",
    "Description": "A large fruiting vine known for its edible flesh and seeds, used in culinary and medicinal applications.",
    "Location": "Native to North America, cultivated worldwide in temperate and tropical regions.",
    "Medical_Usage": "Used for its high vitamin content, as a digestive aid, and for its antioxidant properties."
},
{
    "Name": "Radish",
    "Description": "A root vegetable known for its peppery flavor and nutritional value.",
    "Location": "Cultivated worldwide in temperate and subtropical regions.",
    "Medical_Usage": "Used for improving digestion, as a diuretic, and for its antioxidant properties."
},
{
    "Name": "Rose",
    "Description": "A genus of flowering shrubs known for their fragrant flowers and medicinal uses.",
    "Location": "Native to temperate regions of the Northern Hemisphere, cultivated worldwide.",
    "Medical_Usage": "Used for its anti-inflammatory, antioxidant, and skin care properties."
},
{
    "Name": "Sampige",
    "Description": "Also known as Champak, it is a large evergreen tree with fragrant flowers used in traditional medicine.",
    "Location": "Native to South Asia and Southeast Asia, found in tropical and subtropical regions.",
    "Medical_Usage": "Used for treating fever, inflammation, and skin diseases."
},
{
    "Name": "Sapota",
    "Description": "Also known as Sapodilla, it is a tropical fruit tree known for its sweet, brown fruit.",
    "Location": "Native to southern Mexico, Central America, and the Caribbean, now grown in tropical regions worldwide.",
    "Medical_Usage": "Used for its high vitamin content, as a digestive aid, and for treating inflammation."
},
{
    "Name": "Seethaashoka",
    "Description": "A flowering tree with medicinal properties used in traditional medicine.",
    "Location": "Native to the Indian subcontinent, found in tropical and subtropical regions.",
    "Medical_Usage": "Used for treating menstrual disorders, digestive issues, and as an analgesic."
},
{
    "Name": "Seethapala",
    "Description": "Also known as Custard Apple, it is a small deciduous tree with sweet, edible fruits.",
    "Location": "Native to the tropical Americas, now grown in tropical regions worldwide.",
    "Medical_Usage": "Used for its high vitamin content, as a digestive aid, and for treating infections."
},
{
    "Name": "Spinach",
    "Description": "A leafy green vegetable known for its high nutritional value.",
    "Location": "Cultivated worldwide in temperate and tropical regions.",
    "Medical_Usage": "Rich in vitamins and minerals, used for improving digestion and as an antioxidant."
},
{
    "Name": "Tamarind",
    "Description": "A tropical tree known for its edible fruit pulp, used in culinary and medicinal applications.",
    "Location": "Native to tropical Africa, now grown in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its digestive properties, as a laxative, and for treating fever."
},
{
    "Name": "Taro",
    "Description": "A tropical plant grown for its edible corms and leaves, used in culinary dishes.",
    "Location": "Native to Southeast Asia, cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its high starch content, as a digestive aid, and for its anti-inflammatory properties."
},
{
    "Name": "Tecoma",
    "Description": "A genus of flowering plants known for their bright yellow flowers and ornamental value.",
    "Location": "Native to the Americas, cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for treating diabetes, digestive disorders, and respiratory ailments."
},
{
    "Name": "Thumbe",
    "Description": "A herbaceous plant used in traditional medicine for its medicinal properties.",
    "Location": "Native to tropical and subtropical regions, commonly found in gardens and cultivated areas.",
    "Medical_Usage": "Used for treating digestive disorders, fever, and skin diseases."
},
{
    "Name": "Tomato",
    "Description": "A widely cultivated fruiting plant known for its edible fruits used in culinary dishes.",
    "Location": "Native to South America, now grown worldwide in temperate and tropical regions.",
    "Medical_Usage": "Rich in vitamins and antioxidants, used for improving digestion and heart health."
},
{
    "Name": "Tulsi",
    "Description": "Also known as Holy Basil, it is a sacred plant in Hinduism with numerous medicinal properties.",
    "Location": "Native to the Indian subcontinent, cultivated in tropical and subtropical regions.",
    "Medical_Usage": "Used for its anti-inflammatory, antimicrobial, and stress-relieving properties."
},
{
    "Name": "Turmeric",
    "Description": "A flowering plant whose rhizomes are used as a spice and in traditional medicine.",
    "Location": "Native to South Asia, cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for its anti-inflammatory, antioxidant, and antimicrobial properties."
},
{
    "Name": "Ashoka",
    "Description": "A small evergreen tree with fragrant flowers, used in traditional medicine.",
    "Location": "Native to the Indian subcontinent, found in tropical and subtropical regions.",
    "Medical_Usage": "Used for treating menstrual disorders, uterine ailments, and as an analgesic."
},
{
    "Name": "Vetiver",
    "Description": "A perennial grass known for its aromatic roots, used in traditional medicine and perfumery.",
    "Location": "Native to India, cultivated in tropical and subtropical regions worldwide.",
    "Medical_Usage": "Used for treating anxiety, insomnia, and as an antiseptic."
},
{
    "Name": "Vinca",
    "Description": "A genus of flowering plants commonly known as periwinkle, used for its medicinal properties.",
    "Location": "Native to Europe, Northwest Africa, and Southwest Asia, cultivated in temperate and tropical regions.",
    "Medical_Usage": "Used for treating diabetes, high blood pressure, and cancer."
},
{
    "Name": "Winter Cherry",
    "Description": "Also known as Ashwagandha, it is a small shrub with medicinal properties used in traditional medicine.",
    "Location": "Native to India, North Africa, and the Middle East.",
    "Medical_Usage": "Used for its adaptogenic properties, treating stress, anxiety, and improving vitality."
},
{
    "Name": "Zinnia",
    "Description": "A genus of flowering plants known for their bright, colorful flowers, used in ornamental gardening and traditional medicine.",
    "Location": "Native to North and South America, cultivated worldwide in gardens and as decorative plants.",
    "Medical_Usage": "Used for treating skin diseases and as an anti-inflammatory."
}
]